## Intro to the Merging, Joining, and Concatenating Module:

In [1]:
import pandas as pd

In [66]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

## The pd.concat() Method - Part 1:

In [3]:
## used to combine dataframes together into 1

In [4]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

In [5]:
len(week1)

250

In [6]:
len(week2)

250

In [7]:
pd.concat([week1, week2], ignore_index = True) ##ignore the current index

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [8]:
len(pd.concat([week1, week2]))

500

## The pd.concat() Method - Part 2:

In [9]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

In [10]:
sales = pd.concat([week1, week2], keys = ["Week 1", "Week 2"])

In [11]:
sales.ix["Week 1"]

AttributeError: 'DataFrame' object has no attribute 'ix'

## The .append() Method on a DataFrame:

In [ ]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

In [ ]:
sales = week2.append(week1, ignore_index = True)

## Inner Joins, Part 1:

In [ ]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

In [ ]:
week1.head()

In [ ]:
week2.head()

In [ ]:
week1.merge(week2, how = "inner", on = "Customer ID", suffixes = [" - Week 1", "- Week 2"])

In [ ]:
week1[week1["Customer ID"] == 155]

In [ ]:
week2[week2["Customer ID"] == 155]

## Inner Joins, Part 2:

In [ ]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

In [ ]:
week1.head()

In [ ]:
week2.head()

In [ ]:
week1.merge(week2, how = "inner", on = ["Customer ID", "Food ID"])

In [ ]:
week1[week1["Customer ID"] == 578]

In [ ]:
week2[week2["Customer ID"] == 578]

## Outer Joins:

In [ ]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

In [ ]:
week1.head()

In [ ]:
week2.head()

In [ ]:
merged = week1.merge(week2, how = "outer", on = "Customer ID", suffixes = [" - Week 1", "- Week 2"],
           indicator = True) ## create an additional column on the right

In [ ]:
merged["_merge"].value_counts()

In [ ]:
mask = merged["_merge"].isin(["left_only", "right_only"])
merged[mask]

## Left Joins:

In [ ]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

In [12]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [13]:
foods.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [17]:
week1 = week1.merge(foods, how = "left", on = "Food ID", sort = True)

In [18]:
week1.head()

   Customer ID  Food ID Food Item  Price
0          658        1     Sushi   3.99
1          600        1     Sushi   3.99
2          155        1     Sushi   3.99
3          341        1     Sushi   3.99
4           20        1     Sushi   3.99

## The left_on and right_on Parameters:

In [16]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv")

In [19]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [20]:
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [29]:
week2 = week2.merge(customers, how = "left", left_on = "Customer ID", right_on = "ID", sort = True).drop("ID", axis = "columns")

In [30]:
week2.head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,8,6,Frances,Adams,Female,Dabshots,Developer III
1,13,2,Ruth,Alvarez,Female,Twitterlist,Mechanical Systems Engineer
2,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive
3,24,8,Donna,Thomas,Female,Jaxbean,Chief Design Engineer
4,27,4,Jessica,Bennett,Female,Twitternation,Account Executive

## Merging by Indexes with the left_index and right_index Parameters:

In [37]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv", index_col = "ID")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv", index_col = "Food ID")

In [35]:
customers.head()

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive
4      Steven     Evans    Male     Fatz               Registered Nurse
5        Judy  Morrison  Female  Demivee                Legal Assistant

In [39]:
foods.head()

          Food Item  Price
Food ID
1             Sushi   3.99
2           Burrito   9.99
3              Taco   2.99
4        Quesadilla   4.25
5             Pizza   2.49

In [40]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [43]:
sales = week1.merge(customers, how = "left", left_on = "Customer ID", right_index = True)

In [46]:
sales.merge(foods, how = "left", left_on = "Food ID", right_index = True)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III,Burrito,9.99
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III,Donut,0.99
...,...,...,...,...,...,...,...,...,...
245,413,9,Diane,Bailey,Female,Wikibox,Technical Writer,Donut,0.99
246,926,6,Anne,Wagner,Female,Skyba,Legal Assistant,Pasta,13.99
247,134,3,Diana,Hall,Female,Quinu,Financial Advisor,Taco,2.99
248,396,6,Juan,Romero,Male,Zoonder,Analyst Programmer,Pasta,13.99
249,535,10,Nancy,Cox,Female,Trudeo,Research Associate,Drink,1.75

In [47]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [48]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [51]:
week1.merge(week2, how = "left", left_index = True, right_index = True, suffixes = [" - Week 1", " - Week 2"])

,Customer ID - Week 1,Food ID - Week 1,Customer ID - Week 2,Food ID - Week 2
0,537,9,688,10
1,97,4,813,7
2,658,1,495,10
3,202,2,189,5
4,155,9,267,3
...,...,...,...,...
245,413,9,783,10
246,926,6,556,10
247,134,3,547,9
248,396,6,252,9
249,535,10,249,6

## The .join() Method:

In [55]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv", index_col = "ID")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv", index_col = "Food ID")
satisfaction = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Satisfaction.csv")

In [56]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [57]:
satisfaction.head()

   Satisfaction Rating
0                    2
1                    7
2                    3
3                    7
4                   10

In [58]:
week1.merge(satisfaction, how = "left", left_index = True, right_index = True)

     Customer ID  Food ID  Satisfaction Rating
0            537        9                    2
1             97        4                    7
2            658        1                    3
3            202        2                    7
4            155        9                   10
..           ...      ...                  ...
245          413        9                    1
246          926        6                    2
247          134        3                    8
248          396        6                   10
249          535       10                    3

[250 rows x 3 columns]

In [60]:
week1.join(satisfaction).head()

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3
3          202        2                    7
4          155        9                   10

## The pd.merge() Method:

In [61]:
week1 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Customers.csv", index_col = "ID")
foods = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Foods.csv", index_col = "Food ID")
satisfaction = pd.read_csv("C:/Users/kkher/Desktop/Pandas/Restaurant - Week 1 Satisfaction.csv")

In [62]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [63]:
customers.head()

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive
4      Steven     Evans    Male     Fatz               Registered Nurse
5        Judy  Morrison  Female  Demivee                Legal Assistant

In [65]:
pd.merge(week1, customers, how = "left", left_on = "Customer ID", right_on = "ID")

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III
...,...,...,...,...,...,...,...
245,413,9,Diane,Bailey,Female,Wikibox,Technical Writer
246,926,6,Anne,Wagner,Female,Skyba,Legal Assistant
247,134,3,Diana,Hall,Female,Quinu,Financial Advisor
248,396,6,Juan,Romero,Male,Zoonder,Analyst Programmer
249,535,10,Nancy,Cox,Female,Trudeo,Research Associate